
const String langHindi = 'हिंदी';

/// Hindi-North India
final Map<String, String> intlHiIn = {

  // 'OK': 'OK',

  //
  //  Register
  //
  'Register': 'खाता पंजीकृत करें',
  'Import': 'खाता आयात करें',
  'Name': 'नाम',
  'Nickname': 'उपनाम',
  'Your nickname': 'आपका उपनाम',

  'Please choose your avatar': 'कृपया अपनी अवतार के लिए एक चित्र चुनें।',
  'Please input your nickname': 'कृपया अपना उपनाम दर्ज करें।',
  'Please agree the privacy policy': 'कृपया गोपनीयता नीति को पढ़ें और स्वीकृति दें।',
  'Failed to import account': 'खाता आयात करने में विफल, कृपया अपने म्नैमोनिक कोड की जाँच करें।',
  'Failed to generate ID': 'ID बनाने में विफल हुआ।',

  'Mnemonic Codes': 'म्नेमोनिक कोड्स',
  'MnemonicCodes::Description': 'म्नेमोनिक मौजूदा खाते का निजी कुंजी है,'
      ' यदि आपके पास नहीं है, तो कृपया नए खाते बनाने के लिए ऊपर-दाएं कोने पर "रजिस्टर" बटन पर क्लिक करें।',

  'Show': 'दिखाएँ',
  'Hide': 'छिपाएँ',
  'Accept': 'स्वीकार',

  //
  //  Photo
  //
  'Camera': 'कैमरा',
  'Album': 'एल्बम',
  'Gallery': 'गैलरी',
  'Pick Image': 'तस्वीर चुनें',
  'Image File Error': 'तस्वीर फ़ाइल त्रुटि',
  'Upload Failed': 'अपलोड विफल',

  'Save to Album': 'एल्बम में सहेजें',
  'Sure to save this image?': 'क्या आप इस छवि को सहेजना चाहते हैं?',
  'Image saved to album': 'छवि सफलतापूर्वक एल्बम में सहेजी गई है।',
  'Failed to save image to album': 'इस छवि को आपके एल्बम में सहेजने में विफल रहा।',

  //
  //  Time
  //
  'AM': 'AM',
  'PM': 'PM',
  'Yesterday': 'कल',

  'Monday': 'सोमवार',
  'Tuesday': 'मंगलवार',
  'Wednesday': 'बुधवार',
  'Thursday': 'बृहस्पतिवार',
  'Friday': 'शुक्रवार',
  'Saturday': 'शनिवार',
  'Sunday': 'रविवार',

  '@several seconds': '@several सेकंड',
  '@several minutes': '@several मिनट',
  '@several hours': '@several घंटे',
  '@several days': '@several दिन',
  '@several months': '@several महीने',

  'Daily': '24 घंटे',    // 'दैनिक',
  'Anon': '3 दिन',
  'Weakly': '7 दिन',    // 'साप्ताहिक',
  'Monthly': '30 दिन',  // 'मासिक',
  'Manually': 'मैन्युअल',

  'Burn After Reading': 'पढ़ने के बाद जला दें',

  //
  //  Connection
  //
  'Waiting': 'प्रतीक्षा',
  'Connecting': 'कनेक्ट हो रहा है',
  'Connected': 'कनेक्ट हो गया है',
  'Handshaking': 'प्रमाणीकरण हो रहा है',
  'Disconnected': 'डिस्कनेक्ट हो गया है',

  //
  //  Alerts
  //
  'Cancel': 'रद्द करें',
  'Confirm': 'पुष्टि करें',
  'Confirm Add': 'जोड़ने की पुष्टि करें',
  'Confirm Delete': 'हटाने की पुष्टि करें',
  'Confirm Share': 'साझा करने की पुष्टि करें',
  'Confirm Forward': 'आगे भेजने की पुष्टि करें',

  'Success': 'सफलता',
  'Error': 'त्रुटि',

  'Fatal Error': 'घातक त्रुटि',

  'Blocked': 'अवरुद्ध',
  'Unblocked': 'अवरुद्ध करें',
  'Muted': 'म्यूट किया गया',
  'Unmuted': 'अनम्यूट किया गया',
  'Permission Denied': 'अनुमति निरस्त',

  'Refresh Stations': 'रिले स्टेशन को ताजगी दें',
  'Shared': 'सफलतापूर्वक साझा किया गया',
  'Forwarded': 'सफलतापूर्वक आगे भेजा गया',

  'Notice': 'नोटिस',
  'Input Name': 'नाम दर्ज करें',
  'Input text message': 'टेक्स्ट संदेश दर्ज करें',

  // Tabs
  'Chats': 'चैट्स',
  'Contacts': 'संपर्क',
  'Me': 'मैं',
  'Services': 'सेवाएं',
  'Service Bots': 'सेवा बॉट',

  // Contacts
  'New Friends': 'नए दोस्त',
  'Group Chats': 'समूह चैट्स',
  'Blocked List': 'ब्लॉक की सूची',
  'Muted List': 'म्यूट की सूची',

  'Search User': 'उपयोगकर्ता खोजें',

  // Settings
  'Settings': 'सेटिंग्स',
  'Export': 'खाता निर्यात करें',
  'Mnemonic': 'म्नेमोनिक',
  'Language': 'भाषा',
  'Brightness': 'चमक',
  'Network': 'नेटवर्क',
  'Relay Stations': 'रिले स्टेशन',
  'Open Source': 'ओपन सोर्स',
  'Terms': 'शर्तें',
  'Privacy Policy': 'गोपनीयता नीति',
  'About': 'बारे में',

  'Edit Profile': 'प्रोफ़ाइल संपादित करें',
  'Change Avatar': 'अवतार बदलें',
  'Update & Broadcast': 'अपडेट और प्रसार',

  'System': 'सिस्टम',
  'Light': 'रोशनी',
  'Dark': 'अंधकार',

  //
  //  Chat Box
  //
  'Hold to Talk': 'बोलने के लिए धरें',
  'Release to Send': 'भेजने के लिए छोड़ें',
  'Release to Cancel': 'रद्द करने के लिए छोड़ें',

  'View More Members': 'और सदस्य देखें',
  'Group Members (@count)': 'समूह सदस्य (@count)',
  'Non-Member': 'गैर सदस्य',
  'Image Not Found': 'तस्वीर नहीं मिली',
  'Failed to load image @filename': 'तस्वीर लोड करने में विफल "@filename"।',

  'Forward Image': 'छवि आगे भेजें',
  'Forward Video': 'वीडियो अग्रेषित करें',
  'Forward Web Page': 'वेब पृष्ठ आगे भेजें',
  'Forward Name Card': 'नाम कार्ड आगे भेजें',

  'Image message forwarded to @chat': 'छवि संदेश को "@chat" को आगे भेज दिया गया है।',
  'Failed to share image with @chat': '"@chat" के साथ छवि साझा करने में विफल रहा।',

  'Video message forwarded to @chat': 'वीडियो संदेश को "@chat" को अग्रेषित किया गया है।',
  'Failed to share video with @chat': 'वीडियो को "@chat" के साथ साझा करने में विफल रहा।',

  'Web Page @title forwarded to @chat': 'वेब पृष्ठ "@title" को "@chat" को आगे भेज दिया गया है।',
  'Failed to share Web Page @title with @chat': '"@chat" के साथ वेब पृष्ठ "@title" को साझा करने में विफल रहा।',

  'Name Card @name forwarded to @chat': 'नाम कार्ड "@name" को "@chat" को आगे भेज दिया गया है।',
  'Failed to share Name Card @name with @chat': '"@chat" के साथ नाम कार्ड "@name" को साझा करने में विफल रहा।',

  'Chat Details': 'चैट विवरण',
  'Group Chat Details (@count)': 'समूह चैट विवरण (@count)',
  'Group Name': 'समूह का नाम',
  'Owner': 'मालिक',
  'Administrators': 'प्रशासक',
  'Invitations': 'निमंत्रण',

  'Select Participants': 'सहभागियों का चयन करें',
  'Select a Chat': 'एक चैट का चयन करें',

  'Recall Message': 'संदेश वापस बुलाएँ',
  'Sure to recall this message?': 'क्या आप वास्तव में इस संदेश को वापस बुलाना चाहते हैं?'
      ' (यह कार्रवाई आवश्यक रूप से सफल नहीं हो सकती है)',

  'Delete Message': 'संदेश हटाएं',
  'Sure to delete this message?': 'क्या आप वाकई इस संदेश को हटाना चाहते हैं?'
      ' (यह क्रिया पुनर्प्राप्त नहीं की जा सकती)',

  'Waiting to send': 'भेजने की प्रतीक्षा कर रहा है (पुनः प्रयास करने के लिए टैप करें)',
  'No response': 'कोई प्रतिक्रिया नहीं है (पुनः भेजने के लिए टैप करें)',
  'Stranded': 'फँसा हुआ (पुनः भेजने के लिए टैप करें)',
  'Encrypted and sent to relay station': 'एन्क्रिप्ट किया और रिले स्टेशन को भेजा गया',
  'Message is rejected': 'संदेश अस्वीकृत है',
  'Safely delivered': 'सुरक्षित रूप से डिलीवर किया गया',
  'Safely delivered to @count members': 'सुरक्षित रूप से @count सदस्यों को डिलीवर किया गया',

  'Draft': 'मसौदा',
  'Mentioned': 'आपका उल्लेख किया गया',

  //
  //  Video Player
  //
  'Video Player': 'वीडियो प्लेयर',

  'Loading "@url"': '"@url" लोड हो रहा है ...',
  'Failed to load "@url".': '"@url" लोड करने में विफल रहा।',

  'Select TV': 'टीवी चुनें',
  'TV not found': 'टीवी नहीं मिला',
  'Search again': 'फिर से खोजें',
  'Refresh': 'ताज़ा करें',

  //
  //  Web Browser
  //
  'Cannot launch "@url".': '"@url" लॉन्च नहीं कर सकता।',
  'Failed to launch "@url".': '"@url" लॉन्च करने में विफल।',

  //
  //  Check Update
  //
  'Please update app (@version, build @build).': 'कृपया इस ऐप को नवीनतम संस्करण (@version, build @build) में अपडेट करें।',
  'Upgrade': 'अपग्रेड करें',
  'Download': 'डाउनलोड करें',

  //
  //  Profile
  //
  'Remark': 'टिप्पणी',
  'Block Messages': 'संदेश ब्लॉक करें',
  'Mute Notifications': 'अधिसूचना म्यूट करें',

  'Send Message': 'संदेश भेजें',
  'Clear History': 'इतिहास साफ करें',
  'Add Contact': 'संपर्क जोड़ें',
  'Share Contact': 'संपर्क साझा करें',
  'Delete Contact': 'संपर्क हटाएं',
  'Quit Group': 'समूह छोड़ें',
  'Report': 'रिपोर्ट',

  'Contact @name shared to @chat': 'संपर्क "@name" को "@chat" के साथ साझा किया गया है।',
  'Failed to share contact @name with @chat': 'संपर्क "@name" को "@chat" के साथ साझा करने में विफल हुआ।',

  'Profile is updated': 'आपकी प्रोफ़ाइल अपडेट की गई है और इसे सभी दोस्तों को ब्रॉडकास्ट किया गया है!',
  'Failed to update profile': 'प्रोफ़ाइल अपडेट करने में विफल हुआ।',

  'Failed to get private key': 'निजी कुंजी प्राप्त करने में विफल हुआ।',
  'Failed to get visa': 'वीजा प्राप्त करने में विफल हुआ।',
  'Failed to save visa': 'वीजा सहेजने में विफल हुआ।',

  //
  //  Prompts
  //
  'Please input group name': 'कृपया समूह का नाम दर्ज करें।',
  'Please input alias': 'कृपया उपनाम दर्ज करें।',
  'Please review invitations': 'कृपया पहले आमंत्रणों की समीक्षा करें।',

  'Invited by': 'द्वारा आमंत्रित किया गया है',
  'Invitation sent': 'नया आमंत्रण सभी प्रबंधकों को भेजा गया है, अब समीक्षा का इंतजार है।',

  'Sure to add this friend?': 'क्या आप इस दोस्त को जोड़ना चाहते हैं?',
  'Sure to remove this friend?': 'क्या आप इस दोस्त को हटाना चाहते हैं? यह क्रिया चैट इतिहास को भी साफ करेगी।',
  'Sure to remove this group?': 'क्या आप इस समूह को हटाना चाहते हैं? यह क्रिया चैट इतिहास को भी साफ करेगी।',

  'Sure to clear chat history of this friend?': 'क्या आप इस दोस्त के चैट इतिहास को साफ करना चाहते हैं? यह क्रिया पुनः स्थापित नहीं की जा सकती है।',
  'Sure to clear chat history of this group?': 'क्या आप इस समूह के चैट इतिहास को साफ करना चाहते हैं? यह क्रिया पुनः स्थापित नहीं की जा सकती है।',
  'Failed to clear chat history': 'चैट इतिहास को साफ करने में विफल हुआ।',

  'Sure to remove this conversation?': 'क्या आप वाकई इस वार्तालाप को हटाना चाहते हैं? यह क्रिया अपरिवर्तनीय है।',
  'Failed to remove conversation': 'वार्तालाप हटाने में विफल।',

  'Failed to set remark': 'टिप्पणी सेट करने में विफल हुआ।',

  'Never receive message from this contact': 'आप इस संपर्क से कभी भी संदेश प्राप्त नहीं करेंगे।',
  'Receive message from this contact': 'आप इस संपर्क से संदेश प्राप्त कर सकते हैं।',

  'Never receive notification from this contact': 'आप इस संपर्क से कभी भी सूचनाएं प्राप्त नहीं करेंगे।',
  'Receive notification from this contact': 'आप इस संपर्क से सूचनाएं प्राप्त कर सकते हैं।',

  'Grant to access external storage': 'आपको बाह्य संग्रहण तक पहुँचने की अनुमति देनी चाहिए।',
  'Grant to access photo album': 'आपको फोटो एल्बम तक पहुँचने की अनुमति देनी चाहिए।',
  'Grant to access camera': 'आपको कैमरा तक पहुँचने की अनुमति देनी चाहिए।',
  'Grant to access microphone': 'आपको माइक्रोफ़ोन तक पहुँचने की अनुमति देनी चाहिए।',

  //
  //  Cache Files Management
  //

  'Storage': 'संग्रहण',
  'Cache Files Management': 'कैश फ़ाइल प्रबंधन',

  'Total Cached Data': 'कुल कैश डेटा',
  'Cache Files': 'कैश फ़ाइलें',
  'Database': 'डेटाबेस',
  'Avatars': 'अवतार',
  'Message Files': 'संदेश फ़ाइलें',
  'Temporary Files': 'अस्थायी फ़ाइलें',
  'Upload Directory': 'अपलोड निर्देशिका',
  'Download Directory': 'डाउनलोड निर्देशिका',

  'Contains @count file, totaling @size': '@count फ़ाइल शामिल है, कुल आकार @size।',
  'Contains @count files, totaling @size': '@count फ़ाइलें शामिल हैं, कुल आकार @size।',

  'Scan': 'स्कैन',
  'Clear': 'साफ़',

  'Sure to clear all avatar images?': 'क्या आप सभी अवतार छवियाँ साफ़ करना चाहते हैं?',
  'Sure to clear all message files?': 'क्या आप सभी संदेश फ़ाइलें साफ़ करना चाहते हैं? यह कार्रवाई पुनः प्राप्त नहीं की जा सकती!',
  'Sure to clear these temporary files?': 'क्या आप इन अस्थायी फ़ाइलों को साफ़ करना चाहते हैं?',

  'CacheFiles::Description': '* अवतार छवियाँ और संदेश फ़ाइलें आपके डिवाइस पर संग्रहीत होती हैं।\n'
      '* नेटवर्क पर ट्रांसमिट किए गए संदेश फ़ाइलें एन्क्रिप्टेड की गई थीं,'
      ' और मध्यवर्ती नोड्स, जैसे रिले स्टेशन्स, द्वारा डिक्रिप्ट नहीं किया जा सकता।\n'
      '* जब आप इन फ़ाइलों को स्थानीय संग्रह से हटा देते हैं,'
      ' तो आप उन्हें पुनः प्राप्त नहीं कर सकते हैं यहाँ तक कि आप प्रेषक से पुनः भेजने का अनुरोध नहीं करते हैं।\n'
      '* कृपया ध्यान दें कि हमारी फ़ाइल रिले सर्वर केवल संदेश फ़ाइलों के एन्क्रिप्टेड संस्करण को ही कैश कर सकता है'
      ' तकनीकी वजह से अधिकतम 7 दिन तक।\n'
      '* इसलिए, कृपया इस डेटा को सावधानी से संभालें।',

  'TemporaryFiles::Description': '* जब ऐप फ़ाइलें अपलोड या डाउनलोड करता है,'
      ' तो यह सामान्यत: सिस्टम द्वारा आवश्यकता होने पर स्वचालित रूप से साफ़ किए जाने वाले अस्थायी फ़ाइलें बनाता है।\n'
      '* यदि आप इन्हें तुरंत हटाना चाहते हैं, तो आप यहाँ मैन्युअल रूप से उन्हें हटाने का चयन कर सकते हैं।',

  //
  //  Footers
  //

  'ServiceBotList::Description': '* यहां समीक्षा किए गए सेवा बॉट दिखाए गए हैं, जिनमें से कुछ तीसरे पक्ष के प्रदाताओं से हैं;\n'
      '* यदि आप कोई अवैध व्यवहार पाते हैं, तो कृपया सबूत प्राप्त करने और रिपोर्ट करने के लिए ऊपरी दाएं कोने में "रिपोर्ट" बटन पर क्लिक करें;\n'
      '* कोई भी DIMP प्रोटोकॉल का पालन करते हुए सार्वजनिक के लिए ऐसे सेवाएं विकसित और प्रदान कर सकता है;\n'
      '* यदि आप अपना खुद का सेवा बॉट बनाना चाहते हैं, तो हम आपको DIMP दस्तावेज़ पढ़ने,'
      ' GitHub से उदाहरण परियोजनाएँ डाउनलोड करने या सीधे "Albert Moky" से संपर्क करने के लिए आमंत्रित करते हैं।',

  'ChatBox::Description': 'यह ऐप DIM द्वारा संचालित है, एक E2EE (End-to-End Encrypted) प्रौद्योगिकी से।'
      ' आपके संदेश भेजने से पहले इन्हें एन्क्रिप्ट किया जाएगा, सिर्फ प्राप्तकर्ता ही सामग्री को डिक्रिप्ट कर सकता है।',

  'ChatBox::Remind': 'कृपया इस चैट एप्लिकेशन में कोई अवैध जानकारी न भेजें, जिसमें अश्लील, धोखाधड़ी या धमकी देने वाली सामग्री शामिल है, लेकिन इससे सीमित नहीं है।'
      ' यदि आप अवैध जानकारी पाते हैं, तो कृपया रिपोर्ट करने के लिए ऊपरी दाएं कोने में बटन पर क्लिक करें।'
      ' एक अच्छा संचार वातावरण बनाए रखें और मिलकर कानूनों और नियमों का पालन करें। धन्यवाद!',

  'ChatList::Description': '* यहाँ आपके दोस्तों के केवल चैट इतिहासों को दिखाया जाता है;\n'
      '* अजनबियों को "संपर्क -> नए दोस्त" में रखा जाएगा।',

  'Strangers::Description': '* यहाँ वे अजनबी हैं जो आपसे दोस्ती करना चाहते हैं;\n'
      '* आप उन्हें अपने संपर्कों में जोड़ सकते हैं, या उन्हें नजरअंदाज कर सकते हैं।',

  'GroupList::Description': '* यहाँ आपके सभी समूहों के चैट इतिहासों को दिखाया जाता है।',

  'BlockList::Description': '* यहाँ वे स्पैमर्स हैं जिन्होंने आपको ब्लॉक किया है;\n'
      '* इस सूची से आपको कभी भी संदेश प्राप्त नहीं होगा।',

  'MuteList::Description': '* यहाँ वे शोरगुल दोस्त हैं जिन्हें आप बहुत अधिक महत्व नहीं देते;\n'
      '* आप उनके साथ चैट कर सकते हैं, लेकिन इस सूची से आपको कभी भी सूचना प्राप्त नहीं होगी।',

  'Mnemonic::Description': '* म्यूनेमोनिक आपकी निजी कुंजी है, जिन्होंने इन शब्दों को प्राप्त किए हैं वह आपके खाते को स्वामित्व में ले सकते हैं;\n'
      '* आप इसे एक कागज पर लिख सकते हैं और इसे सुरक्षित जगह पर रख सकते हैं,'
      ' इसे स्क्रीनशॉट लेकर अपने कंप्यूटर में स्टोर करना सिफारिश नहीं की जाती है।',

  'Administrators::Description': 'नियम:\n'
      '  1. मालिक या प्रबंधक आमंत्रणों की समीक्षा कर सकते हैं;\n'
      '  2. मालिक या प्रबंधक सदस्यों को सीधे जोड़ सकते/हटा सकते हैं;\n'
      '  3. मालिक प्रबंधकों को नियुक्ति/नियुक्ति हटा सकता है, प्रबंधक स्वयं को इस्तीफा दे सकता है;\n'
      '  4. मालिक समूह का नाम संपादित कर सकता है;\n'
      '  5. मालिक समूह छोड़ नहीं सकता है;\n'
      '  6. संचालक अब पूर्व-सेवा निवृत्त होने से पहले समूह को छोड़ नहीं सकता है।',

  'Invitations::Description': 'नियम:\n'
      '  1. मालिक या प्रबंधक सदस्य को सीधे जोड़ सकते हैं;\n'
      '  2. अन्य सदस्य आमंत्रण बना सकते हैं और प्रबंधक द्वारा समीक्षा के लिए प्रतीक्षा कर सकते हैं;\n'
      '  3. कोई भी प्रबंधक आमंत्रण की पुष्टि कर सकता है और सदस्य सूची को ताजगी दे सकता है।',

  'BurnAfterReading::Description': 'नियम:\n'
      '  1. एक समय अवधि सेट करें, और ऐप्प स्वचालित रूप से उस समय से पहले सभी संदेश और फ़ाइलें हटा देगा;\n'
      '  2. हटाए गए संदेश और फ़ाइलें पुनः प्राप्त नहीं की जा सकती हैं, इसलिए कृपया सावधानी से इस सुविधा का उपयोग करें;\n'
      '  3. मैन्युअल मोड पर सेट करने से संदेश और फ़ाइलें स्वचालित रूप से हटाए नहीं जाएंगे।',

  'RelayStations::Description': 'नियम:\n'
      '  1. सबसे तेज़ प्रतिक्रिया वाली स्टेशन को वर्तमान रिले स्टेशन के रूप में चुना जाएगा;\n'
      '  2. अगर कुछ स्टेशन चुने गए हों, तो चुने गए स्टेशनों में से सबसे तेज़ को चुनेगा;\n'
      '  3. अगर कोई स्टेशन नहीं चुना गया हो, तो सभी स्टेशनों से स्वचालित रूप से चुनेगा।',

};
