
const String langBengali = 'বাংলা';

/// Bengali-Bangladesh
final Map<String, String> intlBnBd = {

  // 'OK': 'OK',

  //
  //  Register
  //
  'Register': 'অ্যাকাউন্ট নিবন্ধন',
  'Import': 'অ্যাকাউন্ট আমদানি',
  'Name': 'নাম',
  'Nickname': 'ডাকনাম',
  'Your nickname': 'তোমার ডাকনাম',

  'Please choose your avatar': 'দয়া করে আপনার অবতার হিসাবে একটি ছবি নির্বাচন করুন।',
  'Please input your nickname': 'অনুগ্রহ করে আপনার ডাকনাম ইনপুট করুন।',
  'Please agree the privacy policy': 'অনুগ্রহ করে গোপনীয়তা নীতি পড়ুন এবং অবশ্যই অগ্রমান করুন।',
  'Failed to import account': 'অ্যাকাউন্ট আমদানি ব্যর্থ, অনুগ্রহ করে আপনার মনেমনিক কোড পরীক্ষা করুন।',
  'Failed to generate ID': 'আইডি তৈরি করতে ব্যর্থ।',

  'Mnemonic Codes': 'মনেমনিক কোডস',
  'MnemonicCodes::Description': 'মনেমনিক হল একটি বিদ্যমান অ্যাকাউন্টের জন্য ব্যক্তিগত কী,'
      ' যদি আপনার কোনও না থাকে, তবে দয়া করে নীচে ডান-উত্তর কোণে "রেজিস্টার" বোতামটি ক্লিক করুন এবং একটি নতুন তৈরি করুন।',

  'Show': 'দেখাও',
  'Hide': 'লুকাও',
  'Accept': 'অভিজ্ঞান করা',

  //
  //  Photo
  //
  'Camera': 'ক্যামেরা',
  'Album': 'অ্যালবাম',
  'Gallery': 'গ্যালারি',
  'Pick Image': 'চিত্র নির্বাচন করুন',
  'Image File Error': 'চিত্র ফাইল ত্রুটি',
  'Upload Failed': 'আপলোড ব্যর্থ',

  'Save to Album': 'অ্যালবামে সংরক্ষণ করুন',
  'Sure to save this image?': 'আপনি কি নিশ্চিত যে এই ছবি সংরক্ষণ করতে চান?',
  'Image saved to album': 'ছবি সফলভাবে অ্যালবামে সংরক্ষিত হয়েছে।',
  'Failed to save image to album': 'এই ছবি আপনার অ্যালবামে সংরক্ষণ করতে ব্যর্থ হয়েছে।',

  //
  //  Time
  //
  'AM': 'এএম',
  'PM': 'পিএম',
  'Yesterday': 'গতকাল',

  'Monday': 'সোমবার',
  'Tuesday': 'মঙ্গলবার',
  'Wednesday': 'বুধবার',
  'Thursday': 'বৃহস্পতিবার',
  'Friday': 'শুক্রবার',
  'Saturday': 'শনিবার',
  'Sunday': 'রবিবার',

  '@several seconds': '@several সেকেন্ড',
  '@several minutes': '@several মিনিট',
  '@several hours': '@several ঘণ্টা',
  '@several days': '@several দিন',
  '@several months': '@several মাস',

  'Daily': '24 ঘন্টা',   // 'প্রতিদিন',
  'Anon': '3 দিন',
  'Weakly': '7 দিন',    // 'সাপ্তাহিক',
  'Monthly': '30 দিন',  // 'Monthly',
  'Manually': 'ম্যানুয়ালি',

  'Burn After Reading': 'পড়ার পরে জ্বলাও',

  //
  //  Connection
  //
  'Waiting': 'অপেক্ষণ করা হচ্ছে',
  'Connecting': 'সংযোগ হচ্ছে',
  'Connected': 'সংযুক্ত',
  'Handshaking': 'প্রমাণীকরণ',
  'Disconnected': 'সংযুক্ত হয়নি',

  //
  //  Alerts
  //
  'Cancel': 'বাতিল করুন',
  'Confirm': 'নিশ্চিত করুন',
  'Confirm Add': 'নিশ্চিত করুন সংযোজন',
  'Confirm Delete': 'নিশ্চিত করুন মোছা',
  'Confirm Share': 'নিশ্চিত করুন ভাগাভাগি',
  'Confirm Forward': 'নিশ্চিত করুন পুনরায় প্রেরণ',

  'Success': 'সাফল্য',
  'Error': 'ত্রুটি',

  'Fatal Error': 'মৃত্যুবার্তা',

  'Blocked': 'অবরোধিত',
  'Unblocked': 'অবরোধ বিলোপ',
  'Muted': 'শান্ত',
  'Unmuted': 'শান্ত বাতিল',
  'Permission Denied': 'অনুমতি অস্বীকৃত',

  'Refresh Stations': 'রিলে স্টেশনগুলি পুনঃলোড করুন',
  'Shared': 'ভাগাভাগি সফলভাবে সম্পন্ন',
  'Forwarded': 'পুনরায় প্রেরণ সফলভাবে সম্পন্ন',

  'Notice': 'বিজ্ঞপ্তি',
  'Input Name': 'নাম ইনপুট করুন',
  'Input text message': 'ম্যাসেজ ইনপুট করুন',

  // Tabs
  'Chats': 'চ্যাটস',
  'Contacts': 'যোগাযোগ',
  'Me': 'আমি',
  'Services': 'সেবা',
  'Service Bots': 'সেবা বট',

  // Contacts
  'New Friends': 'নতুন বন্ধু',
  'Group Chats': 'গোষ্ঠী চ্যাটস',
  'Blocked List': 'অবরোধিত তালিকা',
  'Muted List': 'শান্ত তালিকা',

  'Search User': 'ব্যবহারকারী অনুসন্ধান করুন',

  // Settings
  'Settings': 'সেটিংস',
  'Export': 'অ্যাকাউন্ট রফতানি',
  'Mnemonic': 'মনেমনিক',
  'Language': 'ভাষা',
  'Brightness': 'উজ্জ্বলতা',
  'Network': 'নেটওয়ার্ক',
  'Relay Stations': 'রিলে স্টেশন',
  'Open Source': 'ওপেন সোর্স',
  'Terms': 'শর্তাবলী',
  'Privacy Policy': 'গোপনীয়তা নীতি',
  'About': 'সম্পর্কে',

  'Edit Profile': 'প্রোফাইল সম্পাদনা',
  'Change Avatar': 'অবতার পরিবর্তন করুন',
  'Update & Broadcast': 'আপডেট এবং ব্রডকাস্ট',

  'System': 'সিস্টেম',
  'Light': 'হালকা',
  'Dark': 'অন্ধকার',

  //
  //  Chat Box
  //
  'Hold to Talk': 'ধরে রাখুন কথা বলতে',
  'Release to Send': 'প্রেরণ করতে মুক্তি দিন',
  'Release to Cancel': 'বাতিল করতে মুক্তি দিন',

  'View More Members': 'আরো সদস্য দেখুন',
  'Group Members (@count)': 'গ্রুপ সদস্য (@count)',
  'Non-Member': 'অসদস্য',
  'Image Not Found': 'চিত্র পাওয়া যায়নি',
  'Failed to load image @filename': 'চিত্র "@filename" লোড করতে ব্যর্থ।',

  'Forward Image': 'ছবি পুনরায় প্রেরণ করুন',
  'Forward Video': 'ভিডিও প্রেরিত করুন',
  'Forward Web Page': 'ওয়েব পৃষ্ঠা পুনরায় প্রেরণ করুন',
  'Forward Name Card': 'নাম কার্ড পুনরায় প্রেরণ করুন',

  'Image message forwarded to @chat': 'ছবি বার্তা পুনরায় প্রেরিত হয়েছে "@chat" কে।',
  'Failed to share image with @chat': 'ছবি শেয়ার করতে ব্যর্থ হয়েছে "@chat" কে।',

  'Video message forwarded to @chat': 'ভিডিও বার্তা @chat এ প্রেরিত করা হয়েছে।',
  'Failed to share video with @chat': '@chat এর সাথে ভিডিও ভাগাভাগি করা যায়নি।',

  'Web Page @title forwarded to @chat': 'ওয়েব পৃষ্ঠা "@title" পুনরায় প্রেরিত হয়েছে "@chat" কে।',
  'Failed to share Web Page @title with @chat': 'ওয়েব পৃষ্ঠা শেয়ার করতে ব্যর্থ হয়েছে "@title" কে "@chat" কে।',

  'Name Card @name forwarded to @chat': 'নাম কার্ড "@name" পুনরায় প্রেরিত হয়েছে "@chat" কে।',
  'Failed to share Name Card @name with @chat': 'নাম কার্ড শেয়ার করতে ব্যর্থ হয়েছে "@name" কে "@chat" কে।',

  'Chat Details': 'চ্যাটের বিশদ',
  'Group Chat Details (@count)': 'গোষ্ঠী চ্যাটের বিশদ (@count)',
  'Group Name': 'গোষ্ঠীর নাম',
  'Owner': 'মালিক',
  'Administrators': 'প্রশাসক',
  'Invitations': 'আমন্ত্রণ',

  'Select Participants': 'অংশগ্রহণকারী নির্বাচন করুন',
  'Select a Chat': 'একটি চ্যাট নির্বাচন করুন',

  'Recall Message': 'মেসেজ পুনর্বরত করা',
  'Sure to recall this message?': 'আপনি কি নিশ্চিত যে এই বার্তাটি পুনর্বরত করতে চান?'
      ' (এই কর্ম অবশ্যই সফল হবে না)',

  'Waiting to send': 'প্রেরণের জন্য অপেক্ষমান (পুনরাবর্তনের জন্য ট্যাপ করুন)',
  'No response': 'কোনও প্রতিক্রিয়া নেই (পুনরাবর্তনের জন্য ট্যাপ করুন)',
  'Stranded': 'অপসারিত (পুনরাবর্তনের জন্য ট্যাপ করুন)',
  'Encrypted and sent to relay station': 'এনক্রিপ্ট এবং রিলে স্টেশনে প্রেরিত',
  'Message is rejected': 'বার্তা প্রত্যাখ্যান',
  'Safely delivered': 'নিরাপদে পৌঁছেছে',
  'Safely delivered to @count members': 'নিরাপদে @count সদস্যদের কাছে পৌঁছেছে',

  'Draft': 'খসড়া',
  'Mentioned': 'তোমার উল্লেখ হয়েছে',

  //
  //  Video Player
  //
  'Video Player': 'ভিডিও প্লেয়ার',

  'Loading "@url"': '"@url" লোড হচ্ছে ...',
  'Failed to load "@url".': '"@url" লোড করা ব্যর্থ হয়েছে।',

  'Select TV': 'টিভি নির্বাচন করুন',
  'TV not found': 'টিভি পাওয়া যায়নি',
  'Search again': 'আবার অনুসন্ধান করুন',
  'Refresh': 'রিফ্রেশ করুন',

  //
  //  Web Browser
  //
  'Cannot launch "@url".': '"@url" চালু করতে পারছি না।',
  'Failed to launch "@url".': '"@url" চালু করতে ব্যর্থ হয়েছে।',

  //
  //  Check Update
  //
  'Please update app (@version, build @build).': 'অনুগ্রহ করে অ্যাপটি সর্বশেষ সংস্করণে আপডেট করুন (@version, build @build)।',
  'Upgrade': 'আপগ্রেড',
  'Download': 'ডাউনলোড করুন',

  //
  //  Profile
  //
  'Remark': 'মন্তব্য',
  'Block Messages': 'বার্তা অবরোধ করুন',
  'Mute Notifications': 'মিউট বিজ্ঞপ্তি',

  'Send Message': 'বার্তা প্রেরণ করুন',
  'Clear History': 'ইতিহাস মুছে ফেলুন',
  'Add Contact': 'যোগ করুন',
  'Share Contact': 'যোগাযোগ ভাগ করুন',
  'Delete Contact': 'যোগাযোগ মুছে ফেলুন',
  'Quit Group': 'গোষ্ঠী ছাড়ুন',
  'Report': 'রিপোর্ট',

  'Contact @name shared to @chat': '@name যোগাযোগ @chat এ ভাগ করা হয়েছে।',
  'Failed to share contact @name with @chat': '@name যোগাযোগ @chat এ ভাগাভাগি করতে ব্যর্থ হয়েছে।',

  'Profile is updated': 'আপনার প্রোফাইল আপডেট হয়েছে এবং সমস্ত বন্ধুদের কাছে ব্রডকাস্ট হয়েছে!',
  'Failed to update profile': 'প্রোফাইল আপডেট করতে ব্যর্থ হয়েছে।',

  'Failed to get private key': 'ব্যক্তিগত চাবি পেতে ব্যর্থ হয়েছে।',
  'Failed to get visa': 'ভিসা ডকুমেন্ট পেতে ব্যর্থ হয়েছে।',
  'Failed to save visa': 'ভিসা ডকুমেন্ট সংরক্ষণ করতে ব্যর্থ হয়েছে।',

  //
  //  Prompts
  //
  'Please input group name': 'দয়া করে গোষ্ঠীর নাম ইনপুট করুন।',
  'Please input alias': 'দয়া করে উপনাম ইনপুট করুন।',
  'Please review invitations': 'দয়া করে প্রথমে আমন্ত্রণ পর্যালোচনা করুন।',

  'Invited by': 'দ্বারা আমন্ত্রিত',
  'Invitation sent': 'একটি নতুন আমন্ত্রণ সমস্ত প্রশাসকদের কাছে পাঠানো হয়েছে, এখন পর্যালোচনা করার জন্য অপেক্ষা করছে।',

  'Sure to add this friend?': 'আপনি কি এই বন্ধুকে যোগ করতে চান?',
  'Sure to remove this friend?': 'আপনি কি নিশ্চিত যে এই বন্ধুকে মুছতে চান?'
      ' এই ক্রিয়াটি চ্যাট ইতিহাস পরিষ্কার করবে।',
  'Sure to remove this group?': 'আপনি কি নিশ্চিত যে এই গোষ্ঠীটি মুছতে চান?'
      ' এই ক্রিয়াটি চ্যাট ইতিহাস পরিষ্কার করবে।',

  'Sure to clear chat history of this friend?': 'আপনি কি নিশ্চিত যে এই বন্ধুর চ্যাট ইতিহাস পরিষ্কার করতে চান?'
      ' এই ক্রিয়াটি পূর্বাভাস করা যাবে না।',
  'Sure to clear chat history of this group?': 'আপনি কি নিশ্চিত যে এই গোষ্ঠীর চ্যাট ইতিহাস পরিষ্কার করতে চান?'
      ' এই ক্রিয়াটি পূর্বাভাস করা যাবে না।',
  'Failed to clear chat history': 'চ্যাট ইতিহাস পরিষ্কার করতে ব্যর্থ হয়েছে।',

  'Sure to remove this conversation?': 'আপনি কি নিশ্চিত যে আপনি এই কথোপকথনটি মুছে ফেলতে চান? এই ক্রিয়াটি পুনরুদ্ধারযোগ্য নয়।',
  'Failed to remove conversation': 'কথোপকথন মুছে ফেলতে ব্যর্থ হয়েছে।',

  'Failed to set remark': 'মন্তব্য সেট করতে ব্যর্থ হয়েছে।',

  'Never receive message from this contact': 'আপনি এই যোগাযোগ থেকে আর কখনও বার্তা পাবেন না।',
  'Receive message from this contact': 'এখন আপনি এই যোগাযোগ থেকে বার্তা পাবেন।',

  'Never receive notification from this contact': 'আপনি এই যোগাযোগ থেকে আর কখনও বিজ্ঞপ্তি পাবেন না।',
  'Receive notification from this contact': 'এখন আপনি এই যোগাযোগ থেকে বিজ্ঞপ্তি পাবেন।',

  'Grant to access external storage': 'আপনাকে বাইরের সংরক্ষণাগারে প্রবেশের অনুমতি দিতে হবে।',
  'Grant to access photo album': 'আপনাকে ফটো অ্যালবামে প্রবেশের অনুমতি দিতে হবে।',
  'Grant to access camera': 'আপনাকে ক্যামেরা ব্যবহার করার অনুমতি দিতে হবে।',
  'Grant to access microphone': 'আপনাকে মাইক্রোফোন ব্যবহার করার অনুমতি দিতে হবে।',

  //
  //  Cache Files Management
  //

  'Storage': 'সংরক্ষণাগার',
  'Cache Files Management': 'ক্যাশ ফাইল ব্যবস্থাপনা',

  'Total Cached Data': 'মোট ক্যাশ ডেটা',
  'Cache Files': 'ক্যাশ ফাইল',
  'Avatars': 'অবতার',
  'Message Files': 'বার্তা ফাইল',
  'Temporary Files': 'অস্থায়ী ফাইল',
  'Upload Directory': 'আপলোড ডিরেক্টরি',
  'Download Directory': 'ডাউনলোড ডিরেক্টরি',

  'Scan': 'স্ক্যান',
  'Clear': 'সাফ',

  'Sure to clear all avatar images?': 'আপনি কি সমস্ত অবতার ইমেজ মুছে ফেলতে চান?',
  'Sure to clear all message files?': 'আপনি কি সমস্ত বার্তা ফাইল মুছে ফেলতে চান? এই অপারেশনটি পুনরুদ্ধার করা যাবে না!',
  'Sure to clear these temporary files?': 'আপনি কি এই অস্থায়ী ফাইলগুলি মুছে ফেলতে চান?',

  'CacheFiles::Description': '* অবতার ইমেজ এবং বার্তা ফাইল আপনার ডিভাইসে সংরক্ষিত থাকে।\n'
      '* নেটওয়ার্কে প্রেরিত বার্তা ফাইলগুলি এনক্রিপ্ট করা হয়েছিল,'
      ' এবং রিলে স্টেশন সহ মধ্যস্থ নোড দ্বারা এগুলি ডিক্রিপ্ট করা যাবে না।\n'
      '* স্থানীয় স্টোরেজ থেকে এই ফাইলগুলি মুছে ফেললে,'
      ' আপনি সাধারণত এগুলি পুনরুদ্ধার করতে পারবেন না যদি আপনি প্রেরকে এগুলি পুনরুদ্ধার করার জন্য অনুরোধ না করেন।\n'
      '* আমাদের ফাইল রিলে সার্ভার কেবলমাত্র বার্তা ফাইলের এনক্রিপ্টেড সংস্করণ ক্যাশ করতে পারে'
      ' সর্বোপরি 7 দিন পর্যন্ত।\n'
      '* তাই, দয়া করে এই ডেটা সাবধানে ব্যবহার করুন।',

  'TemporaryFiles::Description': '* যখন অ্যাপ্লিকেশন ফাইল আপলোড বা ডাউনলোড করে,'
      ' তখন সিস্টেম সাধারণত প্রয়োজনে অটোমেটিকভাবে অস্থায়ী ফাইল তৈরি করে।\n'
      '* আপনি যদি চান তাদের অবিলম্বে সরানো, তবে আপনি এখানে ম্যানুয়ালি তাদের মুছে ফেলতে পারেন।',

  //
  //  Footers
  //

  'ServiceBotList::Description': '* এখানে পর্যালোচনা করা সেবা বটগুলি দেখানো হয়েছে, যার মধ্যে কিছু তৃতীয় পক্ষের প্রদানকারীর;\n'
      '* আপনি যদি কোনও অবৈধ আচরণ খুঁজে পান, দয়া করে উপরের ডান কোণে "রিপোর্ট" বোতামে ক্লিক করুন যাতে প্রমাণ সংগ্রহ করে রিপোর্ট করতে পারেন;\n'
      '* যে কেউ DIMP প্রোটোকল অনুসরণ করলে জনসাধারণের জন্য এই ধরনের সেবা বিকাশ ও প্রদান করতে পারে;\n'
      '* যদি আপনি আপনার নিজস্ব সেবা বট তৈরি করতে চান, আমরা আপনাকে DIMP নথি পড়ার জন্য আমন্ত্রণ জানাচ্ছি,'
      ' GitHub থেকে উদাহরণ প্রকল্প ডাউনলোড করতে বা সরাসরি "Albert Moky" এর সাথে যোগাযোগ করতে।',

  'ChatBox::Description': 'এই অ্যাপটি DIM দ্বারা চালিত, এটি একটি E2EE (End-to-End Encrypted) প্রযুক্তি।'
      ' আপনার বার্তা প্রেরণের আগে এটি এনক্রিপ্ট হবে, প্রাপক ছাড়া কেউ কন্টেন্ট ডিক্রিপ্ট করতে পারবেনা।',

  'ChatBox::Remind': 'অনুগ্রহ করে এই চ্যাট অ্যাপ্লিকেশনে কোনো অবৈধ তথ্য পাঠাবেন না, যার মধ্যে অশ্লীল, প্রতারণামূলক বা হুমকিস্বরূপ বিষয়বস্তু অন্তর্ভুক্ত রয়েছে কিন্তু সীমাবদ্ধ নয়।'
      ' যদি আপনি অবৈধ তথ্য খুঁজে পান, দয়া করে রিপোর্ট করতে উপরের ডান কোণে বোতামে ক্লিক করুন।'
      ' একটি ভাল যোগাযোগের পরিবেশ বজায় রাখুন এবং একসাথে আইন ও বিধিনিষেধ মেনে চলুন। ধন্যবাদ!',

  'ChatList::Description': '* এখানে কেবল আপনার বন্ধুদের চ্যাট ইতিহাস দেখানো হয়;\n'
      '* অজানা ব্যক্তিগুলি "যোগাযোগ -> নতুন বন্ধু" তে রাখা হবে।',

  'Strangers::Description': '* এখানে তাদের ব্যক্তিরা যারা আপনার সাথে বন্ধুত্ব করতে চায়;\n'
      '* আপনি তাদেরকে আপনার যোগাযোগে যোগ করতে পারেন, অথবা তাদেরকে উপেক্ষা করতে পারেন।',

  'GroupList::Description': '* এখানে সমস্ত আপনার গোষ্ঠীর চ্যাট ইতিহাস দেখানো হয়।',

  'BlockList::Description': '* এখানে তাদের স্প্যামারদের দেখানো হয় যাদের আপনি ব্লক করেছেন;\n'
      '* আপনি এই তালিকা থেকে কোনও বার্তা পাবেন না।',

  'MuteList::Description': '* এখানে তাদের বন্ধুবান্ধবের যারা আপনি খুব মূল্যবান মনে করতেন না;\n'
      '* আপনি তাদের সাথে এখনও চ্যাট করতে পারবেন, তবে এই তালিকা থেকে কোনও বিজ্ঞপ্তি পাবেন না।',

  'Mnemonic::Description': '* মনেমনিক হলো আপনার ব্যক্তিগত কী, যে কোনও এই শব্দগুলি পেলে সে আপনার অ্যাকাউন্ট অধিকারী হতে পারে;\n'
      '* এটি একটি কাগজে লিখে রাখতে পারেন এবং কোথাও নিরাপদে রাখতে পারেন,'
      ' এটি একটি ছবি তুলে নিতে এবং এটি আপনার কম্পিউটারে সংরক্ষণ করতে প্রস্তুতি করা সুপারিশ করা হয় না।',

  'Administrators::Description': 'নিয়ম:\n'
      '  1. মালিক বা প্রশাসকরা আমন্ত্রণ পর্যালোচনা করতে পারে;\n'
      '  2. মালিক বা প্রশাসকরা সরাসরি সদস্য যোগ / সরানো করতে পারে;\n'
      '  3. মালিক প্রশাসকদের নিয়োগ দেওয়া বা বরখাস্ত হয়, প্রশাসকগণ নিজে সমর্থন করতে পারে;\n'
      '  4. মালিক গোষ্ঠীর নাম সম্পাদনা করতে পারে;\n'
      '  5. মালিক গোষ্ঠী ত্যাগ করতে পারবেননা;\n'
      '  6. প্রশাসক পেনশন প্রাপ্ত হওয়া পর্যন্ত গোষ্ঠী ত্যাগ করতে পারবেননা।',

  'Invitations::Description': 'নিয়ম:\n'
      '  1. মালিক বা প্রশাসকরা সরাসরি সদস্য যোগ করতে পারে;\n'
      '  2. অন্যান্য সদস্যরা আমন্ত্রণ তৈরি করতে পারে এবং যাদেরকে পর্যালোচনা করা হবে সেইসব আমন্ত্রণের জন্য অপেক্ষা করতে হবে;\n'
      '  3. যেকোনও প্রশাসক আমন্ত্রণ নিশ্চিত করতে এবং সদস্যের তালিকা পুনরায় করতে পারবেন।',

  'BurnAfterReading::Description': 'নিয়ম:\n'
      '  1. একটি সময়কাল নির্ধারণ করুন, এবং অ্যাপটি সেই সময়ের আগে সমস্ত বার্তা এবং ফাইল স্বয়ংভাবে মুছে ফেলবে;\n'
      '  2. মুছে ফেলা বার্তা এবং ফাইল পুনঃপ্রাপ্ত করা যাবেনা, তাই দয়া করে এই বৈশিষ্ট্যটি সাবধানে ব্যবহার করুন;\n'
      '  3. ম্যানুয়াল মোডে সেট করলে আরও অটোমেটিকভাবে বার্তা এবং ফাইল মুছে ফেলা হবেনা।',

  'RelayStations::Description': 'নিয়ম:\n'
      '  1. সবচেয়ে দ্রুত সার্ভার থাকলে তা নির্বাচিত করা হবে বর্তমান রিলে স্টেশন হিসেবে;\n'
      '  2. যদি কিছু স্টেশন নির্বাচিত হয়, তবে নির্বাচিত করা হবে সেই নির্বাচিত সবচেয়ে দ্রুত;\n'
      '  3. যদি কোনও স্টেশন নির্বাচিত না হয়, তাহলে সব স্টেশন থেকে স্বয়ংক্রিয়ভাবে নির্বাচন করুন।',

};
