
const String langRussian = 'Русский';

/// Russian-Russia
final Map<String, String> intlRuRu = {

  // 'OK': 'OK',

  //
  //  Register
  //
  'Register': 'Регистрация аккаунта',
  'Import': 'Импорт аккаунта',
  'Name': 'Имя',
  'Nickname': 'Никнейм',
  'Your nickname': 'Ваш никнейм',

  'Please input your nickname': 'Пожалуйста, введите свой никнейм.',
  'Please agree the privacy policy': 'Пожалуйста, ознакомьтесь и согласитесь с политикой конфиденциальности.',
  'Failed to import account': 'Не удалось импортировать аккаунт, пожалуйста, проверьте свои мнемокоды.',
  'Failed to generate ID': 'Не удалось сгенерировать ID.',

  'Mnemonic Codes': 'Мнемокоды',
  'MnemonicCodes::Description': 'Мнемокод - это приватный ключ для существующего аккаунта,'
      ' если у вас его нет, пожалуйста, нажмите кнопку "Регистрация" в правом верхнем углу, чтобы сгенерировать новый.',

  'Show': 'Показать',
  'Hide': 'Скрыть',
  'Accept': 'Принять',

  //
  //  Photo
  //
  'Camera': 'Камера',
  'Album': 'Альбом',
  'Gallery': 'Галерея',
  'Pick Image': 'Выбрать изображение',
  'Image File Error': 'Ошибка загрузки изображения',
  'Upload Failed': 'Ошибка загрузки',

  'Save to Album': 'Сохранить в альбом',
  'Sure to save this image?': 'Вы уверены, что хотите сохранить это изображение?',
  'Image saved to album': 'Изображение успешно сохранено в альбоме.',
  'Failed to save image to album': 'Не удалось сохранить это изображение в вашем альбоме.',

  //
  //  Time
  //
  'AM': 'AM',
  'PM': 'PM',
  'Yesterday': 'Вчера',

  'Monday': 'Понедельник',
  'Tuesday': 'Вторник',
  'Wednesday': 'Среда',
  'Thursday': 'Четверг',
  'Friday': 'Пятница',
  'Saturday': 'Суббота',
  'Sunday': 'Воскресенье',

  '@several seconds': '@several секунд',
  '@several minutes': '@several минут',
  '@several hours': '@several часов',
  '@several days': '@several дней',
  '@several months': '@several месяцев',

  'Daily': '24 часа',    // 'Ежедневно',
  'Anon': '3 дней',
  'Weakly': '7 дней',    // 'Еженедельно',
  'Monthly': '30 дней',  // 'Ежемесячно',
  'Manually': 'Вручную',

  'Burn After Reading': 'Сжечь после чтения',

  //
  //  Connection
  //
  'Waiting': 'Ожидание',
  'Connecting': 'Подключение',
  'Connected': 'Подключено',
  'Handshaking': 'Аутентификация',
  'Disconnected': 'Отключено',

  //
  //  Alerts
  //
  'Cancel': 'Отмена',
  'Confirm': 'Подтвердить',
  'Confirm Add': 'Подтвердить Добавление',
  'Confirm Delete': 'Подтвердить Удаление',
  'Confirm Share': 'Подтвердить Общий доступ',
  'Confirm Forward': 'Подтвердить Пересылку',

  'Success': 'Успех',
  'Error': 'Ошибка',

  'Fatal Error': 'Фатальная ошибка',

  'Blocked': 'Заблокировано',
  'Unblocked': 'Разблокировано',
  'Muted': 'Без звука',
  'Unmuted': 'Со звуком',
  'Permission Denied': 'Доступ запрещен',

  'Refresh Stations': 'Обновить Ретрансляционные станции',
  'Shared': 'Успешно общий доступ',
  'Forwarded': 'Успешно переслано',

  'Notice': 'Уведомление',
  'Input Name': 'Введите имя',
  'Input text message': 'Введите текст сообщения',

  // Tabs
  'Chats': 'Чаты',
  'Contacts': 'Контакты',
  'Settings': 'Настройки',

  // Contacts
  'New Friends': 'Новые друзья',
  'Group Chats': 'Групповые чаты',
  'Blocked List': 'Список заблокированных',
  'Muted List': 'Список без звука',

  'Search User': 'Поиск пользователя',

  // Settings
  'Export': 'Экспорт аккаунта',
  'Mnemonic': 'Мнемокод',
  'Language': 'Язык',
  'Brightness': 'Яркость',
  'Network': 'Сеть',
  'Relay Stations': 'Ретрансляционные станции',
  'Open Source': 'Открытый исходный код',
  'Terms': 'Условия',
  'Privacy Policy': 'Политика конфиденциальности',
  'About': 'О нас',

  'Edit Profile': 'Редактировать профиль',
  'Change Avatar': 'Сменить аватар',
  'Update & Broadcast': 'Обновить и тра��слировать',

  'System': 'Система',
  'Light': 'Светлая',
  'Dark': 'Темная',

  //
  //  Chat Box
  //
  'Hold to Talk': 'Удерживайте, чтобы говорить',
  'Release to Send': 'Отпустите, чтобы отправить',
  'Release to Cancel': 'Отпустите, чтобы отменить',

  'View More Members': 'Просмотреть больше участников',
  'Group Members (@count)': 'Участники группы (@count)',
  'Non-Member': 'Не участник',
  'Image Not Found': 'Изображение не найдено',
  'Failed to load image @filename': 'Не удалось загрузить изображение "@filename".',

  'Forward Image': 'Переслать изображение',
  'Forward Web Page': 'Переслать веб-страницу',
  'Forward Name Card': 'Переслать визитку',

  'Image message forwarded to @chat': 'Изображение переслано в "@chat".',
  'Failed to share image with @chat': 'Не удалось поделиться изображением с "@chat".',

  'Web Page @title forwarded to @chat': 'Веб-страница "@title" переслана в "@chat".',
  'Failed to share Web Page @title with @chat': 'Не удалось поделиться веб-страницей "@title" с "@chat".',

  'Name Card @name forwarded to @chat': 'Визитка "@name" переслана в "@chat".',
  'Failed to share Name Card @name with @chat': 'Не удалось поделиться визиткой "@name" с "@chat".',

  'Chat Details': 'Сведения о чате',
  'Group Chat Details (@count)': 'Сведения о групповом чате (@count)',
  'Group Name': 'Название группы',
  'Owner': 'Владелец',
  'Administrators': 'Администраторы',
  'Invitations': 'Приглашения',

  'Select Participants': 'Выберите участников',
  'Select a Chat': 'Выберите чат',

  'Waiting to send': 'Ожидание отправки',
  'Sent to relay station': 'Отправлено на ретрансляцию',
  'Message is rejected': 'Сообщение отклонено',
  'Your friend received': 'Ваш друг получил',
  '@count members received': '@count участник(ов) получил(и)',
  'No response': 'Нет ответа',
  'Stranded': 'Заблокировано',

  'Draft': 'Черновик',

  //
  //  Profile
  //
  'Remark': 'Заметка',
  'Block Messages': 'Заблокировать сообщения',
  'Mute Notifications': 'Отключить уведомления',

  'Send Message': 'Отправить сообщение',
  'Clear History': 'Очистить историю',
  'Add Contact': 'Добавить контакт',
  'Share Contact': 'Поделиться контактом',
  'Delete Contact': 'Удалить контакт',
  'Quit Group': 'Покинуть группу',

  'Contact @name shared to @chat': 'Контакт "@name" поделен с "@chat".',
  'Failed to share contact @name with @chat': 'Не удалось поделиться контактом "@name" с "@chat".',

  'Profile is updated': 'Ваш профиль обновлен и транслирован всем друзьям!',
  'Failed to update profile': 'Не удалось обновить профиль.',

  'Failed to get private key': 'Не удалось получить закрытый ключ.',
  'Failed to get visa': 'Не удалось получить визу.',
  'Failed to save visa': 'Не удалось сохранить визу.',

  //
  //  Prompts
  //
  'Please input group name': 'Пожалуйста, введите название группы.',
  'Please input alias': 'Пожалуйста, введите псевдоним.',
  'Please review invitations': 'Пожалуйста, просмотрите приглашения сначала.',

  'Invited by': 'Пригласил',
  'Invitation sent': 'Новое приглашение отправлено всем администраторам, теперь оно ожидает проверки.',

  'Sure to add this friend?': 'Вы уверены, что хотите добавить этого друга?',
  'Sure to remove this friend?': 'Вы уверены, что хотите удалить этого друга?'
      ' Это действие также удалит историю чата.',
  'Sure to remove this group?': 'Вы уверены, что хотите удалить эту группу?'
      ' Это действие также удалит историю чата.',

  'Sure to clear chat history of this friend?': 'Вы уверены, что хотите очистить историю чата этого друга?'
      ' Это действие не может быть отменено.',
  'Sure to clear chat history of this group?': 'Вы уверены, что хотите очистить историю чата этой группы?'
      ' Это действие не может быть отменено.',
  'Failed to clear chat history': 'Не удалось очистить историю чата.',

  'Failed to set remark': 'Не удалось установить заметку.',

  'Never receive message from this contact': 'Вы больше не будете получать сообщения от этого контакта.',
  'Receive message from this contact': 'Теперь вы можете получать сообщения от этого контакта.',

  'Never receive notification from this contact': 'Вы больше не будете получать уведомления от этого контакта.',
  'Receive notification from this contact': 'Теперь вы можете получать уведомления от этого контакта.',

  'Grant to access external storage': 'Вы должны предоставить разрешение на доступ к внешнему хранилищу.',
  'Grant to access photo album': 'Вы должны предоставить разрешение на доступ к фотоальбому.',
  'Grant to access camera': 'Вы должны предоставить разрешение на доступ к камере.',
  'Grant to access microphone': 'Вы должны предоставить разрешение на доступ к микрофону.',

  //
  //  Footers
  //
  'ChatBox::Description': 'Это приложение работает на технологии DIM, обеспечивающей конечное шифрование (End-to-End Encrypted).'
      ' Ваши сообщения будут зашифрованы перед отправкой и смогут быть расшифрованы только получателем.',

  'ChatList::Description': '* Здесь отображаются истории чатов только с вашими друзьями;\n'
      '* Незнакомцы будут помещены в раздел "Контакты -> Новые друзья".',

  'Strangers::Description': '* Здесь отображаются незнакомцы, которые хотят подружиться с вами;\n'
      '* Вы можете добавить их в свои контакты или просто проигнорировать.',

  'GroupList::Description': '* Здесь показаны истории чатов всех ваших групп.',

  'BlockList::Description': '* Здесь отображаются спамеры, которых вы заблокировали;\n'
      '* Вы больше не будете получать сообщения из этого списка.',

  'MuteList::Description': '* Здесь показаны шумные друзья, которые вам не очень ценны;\n'
      '* Вы все еще можете общаться с ними, но не будете получать уведомлений из этого списка.',

  'Mnemonic::Description': '* Мнемоническая фраза - ваш закрытый ключ, любой, кто узнает эти слова, сможет получить доступ к вашей учетной записи;\n'
      '* Вы можете записать ее на бумаге и хранить в надежном месте,'
      ' но не рекомендуется делать скриншот и сохранять на компьютере.',

  'Administrators::Description': 'Правила:\n'
      '  1. Владелец или администраторы могут просматривать приглашения;\n'
      '  2. Владелец или администраторы могут добавлять/удалять участников напрямую;\n'
      '  3. Владелец может нанимать/увольнять администраторов, администраторы могут увольняться сами;\n'
      '  4. Владелец может изменить название группы;\n'
      '  5. Владелец не может покинуть группу;\n'
      '  6. Администратор не может покинуть группу до момента ухода.',

  'Invitations::Description': 'Правила:\n'
      '  1. Владелец или администраторы могут добавлять участников напрямую;\n'
      '  2. Другие участники могут создавать приглашения, которые будут рассматриваться администраторами;\n'
      '  3. Любой администратор может подтвердить приглашения и обновить список участников.',

  'BurnAfterReading::Description': 'Правила:\n'
      '  1. Установите период времени, и приложение автоматически удалит все сообщения и файлы до этого времени;\n'
      '  2. Удаленные сообщения и файлы не могут быть восстановлены, поэтому используйте эту функцию осторожно;\n'
      '  3. При установке ручного режима сообщения и файлы больше автоматически не удаляются.',

  'RelayStations::Description': 'Правила:\n'
      '  1. В качестве текущей реле-станции будет выбрана станция с самым быстрым ответом;\n'
      '  2. Если выбрано несколько станций, будет выбрана самая быстрая из выбранных;\n'
      '  3. Если станции не выбраны, будет выбрана автоматически из всех станций.',

};
